watermelon233333/stm32_finalcheck/21221289/21221289-第三题/HARDWARE/Header/OLED4PINiic.h
#ifndef __OLED4PINiic_H
#define __OLED4PINiic_H	
#include "stm32f10x.h" 
 	
//////////////////////////////////////////////////////////////////////////////////	 								  
////////////////////////////////////////////////////////////////////////////////// 

void OLED_init(void);
void OLED_clear(void);
void OLED_full(void);	

//OLED¿ØÖÆÓÃº¯Êý
void OLED_WR_Byte(u8 dat,u8 cmd);	    
void OLED_Display_On(void);
void OLED_Display_Off(void);
void OLED_Refresh_Gram(void);	


//void OLED_Clear(void);
void OLED_DrawPoint(u8 x,u8 y,u8 t);
void OLED_Fill(u8 x1,u8 y1,u8 x2,u8 y2,u8 dot);
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 size,u8 mode);
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size);
void OLED_ShowString(u8 x,u8 y,const u8 *p,u8 size);
void OLED_DrawLine(u8 x1, u8 y1, u8 x2, u8 y2);
void OLED_Draw_Circle(u8 x0,u8 y0,u8 r);
void OLED_DrawRectangle(u8 x1, u8 y1, u8 x2, u8 y2);
void OLED_ShowChineseChar(u8 x,u8 y,u16 chr,u8 mode);

void Picture_display(const unsigned char *ptr_pic);
void Picture_ReverseDisplay(const unsigned char *ptr_pic);

#endif
